function fish_greeting
    echo
    echo
    echo -ne '\x1b[38;5;159m'  # Set colour to cyan/light blue (more visible)
    echo ' ▓█████▄  ▄▄▄       ██▓     ██▓███   ▄▄▄      ▒██   ██▒ '
    echo ' ▒██▀ ██▌▒████▄    ▓██▒    ▓██░  ██▒▒████▄    ▒▒ █ █ ▒░ '
    echo ' ░██   █▌▒██  ▀█▄  ▒██░    ▓██░ ██▓▒▒██  ▀█▄  ░░  █   ░ '
    echo ' ░▓█▄   ▌░██▄▄▄▄██ ▒██░    ▒██▄█▓▒ ▒░██▄▄▄▄██  ░ █ █ ▒  '
    echo ' ░▒████▓  ▓█   ▓██▒░██████▒▒██▒ ░  ░ ▓█   ▓██▒▒██▒ ▒██▒ '
    echo '  ▒▒▓  ▒  ▒▒   ▓▒█░░ ▒░▓  ░▒▓▒░ ░  ░ ▒▒   ▓▒█░▒▒ ░ ░▓ ░ '
    echo '  ░ ▒  ▒   ▒   ▒▒ ░░ ░ ▒  ░░▒ ░       ▒   ▒▒ ░░░   ░▒ ░ '
    echo '  ░ ░  ░   ░   ▒     ░ ░   ░░         ░   ▒    ░    ░   '
    echo '    ░          ░  ░    ░  ░               ░  ░ ░    ░   '
    echo '  ░                                                     '
    set_color normal
    fastfetch --key-padding-left 6
end
